export type GradeData = Record<string, { 특수학급: number; 일반학급: number }>;

export const studentData: Record<string, GradeData> = {
  "강남유치원": {
    "3세": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "샛별유치원": {
    "4세": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울관악초등학교병설유치원": {
    "5세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울구암유치원": {
    "5세": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울난곡초등학교병설유치원": {
    "4세": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울남부초등학교병설유치원": {
    "5세": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울남현유치원": {
    "3세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울문창초등학교병설유치원": {
    "4세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5세": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울봉천초등학교병설유치원": {
    "5세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울상도유치원": {
    "5세": {
      "특수학급": 3,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울신성초등학교병설유치원": {
    "5세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울신우유치원": {
    "5세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 1,
      "일반학급": 0
    },
    "3세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울원당초등학교병설유치원": {
    "5세": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울은로유치원": {
    "5세": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "서울은천초등학교병설유치원": {
    "5세": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4세": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울청림유치원": {
    "4세": {
      "특수학급": 4,
      "일반학급": 0
    },
    "3세": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "총신대부속유치원": {
    "4세": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "행복유치원": {
    "5세": {
      "특수학급": 0,
      "일반학급": 1
    },
    "4세": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울강남초등학교": {
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울관악초등학교": {
    "6학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 5,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울구암초등학교": {
    "3학년": {
      "특수학급": 5,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "서울난곡초등학교": {
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울난우초등학교": {
    "6학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 3,
      "일반학급": 2
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    }
  },
  "서울난향초등학교": {
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 3
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울남부초등학교": {
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울남사초등학교": {
    "5학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울남성초등학교": {
    "3학년": {
      "특수학급": 5,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울노량진초등학교": {
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "서울당곡초등학교": {
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    }
  },
  "서울대림초등학교": {
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울동작초등학교": {
    "6학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울문창초등학교": {
    "4학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울미성초등학교": {
    "4학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 2
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울보라매초등학교": {
    "6학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 2
    },
    "5학년": {
      "특수학급": 5,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울본동초등학교": {
    "5학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울봉천초등학교": {
    "4학년": {
      "특수학급": 5,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울봉현초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울사당초등학교": {
    "4학년": {
      "특수학급": 6,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울삼성초등학교": {
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울삼일초등학교": {
    "1학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울상도초등학교": {
    "3학년": {
      "특수학급": 4,
      "일반학급": 3
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울상현초등학교": {
    "6학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울신길초등학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "6학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울신남성초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울신림초등학교": {
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울신봉초등학교": {
    "6학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "서울신상도초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 2
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울신성초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울신우초등학교": {
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울영본초등학교": {
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울영화초등학교": {
    "6학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 2
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울원당초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 2
    },
    "4학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울원신초등학교": {
    "6학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 5,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "서울은로초등학교": {
    "2학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "서울은천초등학교": {
    "4학년": {
      "특수학급": 7,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "6학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울인헌초등학교": {
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "4학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울조원초등학교": {
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "4학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울청룡초등학교": {
    "6학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "서울행림초등학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "서울흑석초등학교": {
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "5학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 1
    }
  },
  "강남중학교": {
    "3학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "강현중학교": {
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "관악중학교": {
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "광신중학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "구암중학교": {
    "2학년": {
      "특수학급": 5,
      "일반학급": 3
    },
    "1학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "국사봉중학교": {
    "3학년": {
      "특수학급": 6,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 5,
      "일반학급": 2
    }
  },
  "난우중학교": {
    "2학년": {
      "특수학급": 5,
      "일반학급": 2
    },
    "1학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 5,
      "일반학급": 1
    }
  },
  "남강중학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "남서울중학교": {
    "3학년": {
      "특수학급": 6,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 4,
      "일반학급": 0
    }
  },
  "남성중학교": {
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 6,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "당곡중학교": {
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 5,
      "일반학급": 0
    }
  },
  "대방중학교": {
    "3학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 1
    }
  },
  "동양중학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "동작중학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "문창중학교": {
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "미성중학교": {
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "봉림중학교": {
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 1
    }
  },
  "봉원중학교": {
    "1학년": {
      "특수학급": 1,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 5,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "사당중학교": {
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 2
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "삼성중학교": {
    "1학년": {
      "특수학급": 2,
      "일반학급": 2
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 4,
      "일반학급": 1
    }
  },
  "상도중학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "상현중학교": {
    "3학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 1
    }
  },
  "성남중학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "신관중학교": {
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "신림중학교": {
    "3학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 0
    },
    "1학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "영등포중학교": {
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "장승중학교": {
    "1학년": {
      "특수학급": 6,
      "일반학급": 3
    },
    "3학년": {
      "특수학급": 6,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 1,
      "일반학급": 1
    }
  },
  "중앙대학교사범대학부속중학교": {
    "1학년": {
      "특수학급": 0,
      "일반학급": 5
    },
    "3학년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "흑석고등학교": {
    "1학년": {
      "특수학급": 5,
      "일반학급": 0
    }
  },
  "경문고등학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "광신고등학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "광신방송예술고등학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "구암고등학교": {
    "1학년": {
      "특수학급": 7,
      "일반학급": 2
    },
    "3학년": {
      "특수학급": 7,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 8,
      "일반학급": 3
    }
  },
  "남강고등학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "당곡고등학교": {
    "1학년": {
      "특수학급": 0,
      "일반학급": 3
    }
  },
  "동작고등학교": {
    "3학년": {
      "특수학급": 3,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 3,
      "일반학급": 2
    },
    "1학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "미림마이스터고등학교": {
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "삼성고등학교": {
    "3학년": {
      "특수학급": 7,
      "일반학급": 0
    },
    "2학년": {
      "특수학급": 5,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 0
    }
  },
  "서울공업고등학교": {
    "3학년": {
      "특수학급": 6,
      "일반학급": 4
    },
    "2학년": {
      "특수학급": 6,
      "일반학급": 4
    },
    "1학년": {
      "특수학급": 7,
      "일반학급": 0
    }
  },
  "서울관광고등학교": {
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 0,
      "일반학급": 4
    }
  },
  "서울미술고등학교": {
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "성남고등학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "성보고등학교": {
    "1학년": {
      "특수학급": 4,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 2,
      "일반학급": 0
    }
  },
  "수도여자고등학교": {
    "2학년": {
      "특수학급": 5,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 6,
      "일반학급": 0
    },
    "3학년": {
      "특수학급": 5,
      "일반학급": 1
    }
  },
  "숭의여자고등학교": {
    "3학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "신림고등학교": {
    "2학년": {
      "특수학급": 5,
      "일반학급": 4
    },
    "1학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 5,
      "일반학급": 3
    }
  },
  "영등포고등학교": {
    "3학년": {
      "특수학급": 7,
      "일반학급": 1
    },
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "1학년": {
      "특수학급": 3,
      "일반학급": 1
    }
  },
  "영락고등학교": {
    "2학년": {
      "특수학급": 4,
      "일반학급": 2
    },
    "1학년": {
      "특수학급": 4,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 1
    }
  },
  "영락의료과학고등학교": {
    "2학년": {
      "특수학급": 0,
      "일반학급": 3
    },
    "1학년": {
      "특수학급": 0,
      "일반학급": 1
    }
  },
  "인헌고등학교": {
    "2학년": {
      "특수학급": 2,
      "일반학급": 1
    },
    "3학년": {
      "특수학급": 1,
      "일반학급": 0
    }
  },
  "누리학교": {
    "4세": {
      "특수학급": 0,
      "일반학급": 5
    },
    "5세": {
      "특수학급": 0,
      "일반학급": 7
    },
    "3세": {
      "특수학급": 0,
      "일반학급": 5
    },
    "2세": {
      "특수학급": 0,
      "일반학급": 3
    }
  },
  "서울삼성학교": {
    "고3년": {
      "특수학급": 0,
      "일반학급": 14
    },
    "초4년": {
      "특수학급": 0,
      "일반학급": 7
    },
    "중1년": {
      "특수학급": 0,
      "일반학급": 4
    },
    "초3년": {
      "특수학급": 0,
      "일반학급": 4
    },
    "초2년": {
      "특수학급": 0,
      "일반학급": 7
    },
    "초6년": {
      "특수학급": 0,
      "일반학급": 7
    },
    "4세": {
      "특수학급": 0,
      "일반학급": 1
    },
    "고1년": {
      "특수학급": 0,
      "일반학급": 8
    },
    "고2년": {
      "특수학급": 0,
      "일반학급": 5
    },
    "중3년": {
      "특수학급": 0,
      "일반학급": 2
    },
    "중2년": {
      "특수학급": 0,
      "일반학급": 9
    },
    "초5년": {
      "특수학급": 0,
      "일반학급": 4
    },
    "초1년": {
      "특수학급": 0,
      "일반학급": 1
    },
    "5세": {
      "특수학급": 0,
      "일반학급": 2
    },
    "0세": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "서울새롬학교": {
    "초4년": {
      "특수학급": 0,
      "일반학급": 5
    },
    "초1년": {
      "특수학급": 0,
      "일반학급": 6
    },
    "초5년": {
      "특수학급": 0,
      "일반학급": 8
    },
    "초2년": {
      "특수학급": 0,
      "일반학급": 6
    },
    "초3년": {
      "특수학급": 0,
      "일반학급": 7
    },
    "중1년": {
      "특수학급": 0,
      "일반학급": 3
    },
    "중2년": {
      "특수학급": 0,
      "일반학급": 6
    },
    "3세": {
      "특수학급": 0,
      "일반학급": 4
    },
    "초6년": {
      "특수학급": 0,
      "일반학급": 6
    },
    "중3년": {
      "특수학급": 0,
      "일반학급": 4
    },
    "4세": {
      "특수학급": 0,
      "일반학급": 1
    },
    "5세": {
      "특수학급": 0,
      "일반학급": 2
    }
  },
  "서울정문학교": {
    "초6년": {
      "특수학급": 0,
      "일반학급": 12
    },
    "초4년": {
      "특수학급": 0,
      "일반학급": 12
    },
    "초3년": {
      "특수학급": 0,
      "일반학급": 12
    },
    "고3년": {
      "특수학급": 0,
      "일반학급": 22
    },
    "초2년": {
      "특수학급": 0,
      "일반학급": 14
    },
    "초1년": {
      "특수학급": 0,
      "일반학급": 9
    },
    "중3년": {
      "특수학급": 0,
      "일반학급": 20
    },
    "고1년": {
      "특수학급": 0,
      "일반학급": 21
    },
    "중1년": {
      "특수학급": 0,
      "일반학급": 19
    },
    "중2년": {
      "특수학급": 0,
      "일반학급": 12
    },
    "전1년": {
      "특수학급": 0,
      "일반학급": 27
    },
    "고2년": {
      "특수학급": 0,
      "일반학급": 13
    },
    "초5년": {
      "특수학급": 0,
      "일반학급": 12
    }
  }
};
